app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1
---
  def create
    user = User.find_by_user_id (session_params[:user_id]) # lookup user in db
    user_email = User.find_by_email(session_params[:email])