app/controllers/users_controller.rb

  def create
   if User.user_id_exists? user_params[:user_id]
     flash[:warning] = 'Sorry, that user id is taken already. Please try again'
     redirect_to new_user_path
   else
     @user = User.create_user!(user_params)
---
INSERT INTO "users" ("user_id", "email", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "arnold"], ["email", "arnold@nick.com"], ["session_token", "1qgr__Ji5bU7WWgwu_waQA"], ["created_at", "2016-09-25 03:27:00.752062"], ["updated_at", "2016-09-25 03:27:00.752062"]]