app/models/user.rb

  def self.create_user! (user_params)
---
INSERT INTO "users" ("user_id", "email", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def self.user_id_exists? (user_id)
    User.where(:user_id => user_id).exists?
---
SELECT  1 AS one FROM "users" WHERE "users"."user_id" = ? LIMIT 1